In [ ]:
import seaborn as sns
df = sns.load_dataset('titanic')
df

In [ ]:
df.info()

pclass, sex, sibsp, parch, embarked, class, who. adult_male, embark_town, alive, alone

In [17]:
import pandas as pd
dfx = pd.get_dummies(df['sex'])
# female -> 0, male -> 1
dfx

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [18]:
df = pd.concat([df,dfx], axis =1)
df

     survived  pclass     sex   age  ...  alive  alone  female male
0           0       3    male  22.0  ...     no  False       0    1
1           1       1  female  38.0  ...    yes  False       1    0
2           1       3  female  26.0  ...    yes   True       1    0
3           1       1  female  35.0  ...    yes  False       1    0
4           0       3    male  35.0  ...     no   True       0    1
..        ...     ...     ...   ...  ...    ...    ...     ...  ...
886         0       2    male  27.0  ...     no   True       0    1
887         1       1  female  19.0  ...    yes   True       1    0
888         0       3  female   NaN  ...     no  False       1    0
889         1       1    male  26.0  ...    yes   True       0    1
890         0       3    male  32.0  ...     no   True       0    1

[891 rows x 17 columns]

In [ ]:
dfx = pd.get_dummies(df['pclass'], prefix='pclass')
# y(service) = ax(pclass) + 0
# y = 0.42
# y = 0*x1 + 0*x2 + 1*x3 --> 3번째
df = pd.concat([df,dfx], axis =1)
df

female	male pclass_1	pclass_2	pclass_3

In [ ]:
df[['fare', 'female',	'male', 'pclass_1',	'pclass_2', 'pclass_3', 'survived']]

In [24]:
X = df[['fare', 'female',	'male', 'pclass_1',	'pclass_2', 'pclass_3']]
Y = df[['survived']]
X.shape, Y.shape

((891, 6), (891, 1))

In [27]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)
X = scaler.transform(X)
X.shape

(891, 6)

In [28]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X,Y)

In [29]:
from sklearn.linear_model import LogisticRegression
logR = LogisticRegression()
logR.fit(x_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [30]:
logR.score(x_train, y_train)

0.7784431137724551